fluffyrabbot/powerfinger/firmware/hub/sdkconfig.defaults
# SPDX-License-Identifier: MIT
# PowerFinger USB Hub Dongle — Default Kconfig

# Target: ESP32-S3
CONFIG_IDF_TARGET="esp32s3"

# Flash: 8MB (ESP32-S3-MINI-1-N8)
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# Partition table: custom (OTA A/B + NVS)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Bluetooth: NimBLE, central role
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n

# NimBLE: max connections (hub connects to up to 4 rings)
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=4

# NimBLE: enable bonding, security manager
CONFIG_BT_NIMBLE_SM_LEGACY=y
CONFIG_BT_NIMBLE_SM_SC=y

# USB: enable TinyUSB HID
CONFIG_TINYUSB_HID_ENABLED=y

# Watchdog
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# OTA: enable rollback
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
